import React from 'react'
import Tweet from './Tweet';

const tweetUser = [
    {
        sender: {
            name: 'sumsung',
            id: '@sumsung',
            img: '/images/samsung.png'
        },
        text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه #روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان #جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری راحی اساسا مورد استفاده قرار گیرد.',
        like: 14
    },
    {
        sender: {
            name: 'بیل گیتس',
            id: '@Bill_Gates',
            img: '/images/bil.png'
        },
        text:  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیکی شرردهای متنواوان جامعه و #متخصصان را می طلبد، تا با نرم ی راحی اساسا مورد استفاده قرار گیرد.',
        like: 4
    },
    {
        sender: {
            name: 'مایک بای',
            id: '@Mike_Bye',
            img: '/images/mike.png'
        },
        text:  'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیکی شرردهای متنواوان جامعه و متخصصان را می طلبد، تا با نرم ی راحی اساسا مورد استفاده قرار گیرد.دهای متنواوان جامعه و متخصصان را می طلدهای متنواوان #جامعه و متخصصان را می طل',
        like: 111
    },
    {
        sender: {
            name: 'شیلی وایت',
            id: '@Shily_white',
            img: '/images/shily.png'
        },
        text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی #تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری راحی اساسا مورد استفاده قرار گیرد.نوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و #آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری راحی اساسا مرصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری راحی اساسا مورد استفاده قرار گیرد.نوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آین',
        like: 22
    }
]

const TweetList = () => {
    return (
        <div>
            {tweetUser.map(item => <Tweet probs={item}/> )}
        </div>
    )
}

export default TweetList
